<?php
$hesaid = $_GET["s"];
echo $hesaid;
echo "<br>";

$kw = array(
	"我靠" => "我靠",
	"叫什么" => "我叫dodo",
	"几岁" => "我才一个多月呢",
	"妈是谁" => "妈妈是琼琼",
	"谁是妈" => "琼琼",
	"谁是你妈" => "琼琼",
	"爸是谁" => "爸爸是菲菲",
	"谁是爸" => "菲菲",
	"谁是你爸" => "菲菲",
	"婆是谁" => "爸爸是菲菲",
	"谁是婆" => "婆婆是婆婆",
	"谁是你婆" => "婆婆是婆婆",
	"奶是谁" => "奶奶是奶奶",
	"谁是奶" => "奶奶是奶奶",
	"谁是你奶" => "奶奶是奶奶",
	"爷是谁" => "爷爷是老侯",
	"谁是爷" => "爷爷是老侯",
	"谁是你爷" => "老侯",
);
$kw = array(
	"a" => "我靠",
	"b" => "我叫dodo"
);

		foreach($kw as $k => $v){
			if(!strpos($hesaid, $k)){
				echo $k;
				echo $v;
			}
			else
				echo "none";
		}
echo "<br>";
strpos("什么人", "什么");
